wosayttn/sdk-bsp-numaker-m55m1/libraries/m5531/rtt_port/emac/drv_gmac.c
/**************************************************************************//**
*
* @copyright (C) 2020 Nuvoton Technology Corp. All rights reserved.
*
* SPDX-License-Identifier: Apache-2.0
*
* Change Logs:
* Date            Author           Notes
* 2021-07-23      Wayne            First version
*
******************************************************************************/

#include "rtconfig.h"

#if defined(BSP_USING_EMAC)

#include <rtthread.h>
#include <rtdevice.h>
#include "lwipopts.h"
#include <netif/ethernetif.h>
#include <netif/etharp.h>
#include <lwip/sys.h>
#include <lwip/icmp.h>
#include <lwip/pbuf.h>
#include "NuMicro.h"
#include <string.h>
#include "synopGMAC_Host.h"

//#define DBG_ENABLE
#undef  DBG_ENABLE
#define DBG_LEVEL  LOG_LVL_ASSERT
#define DBG_SECTION_NAME  "drv_gmac"
#define DBG_COLOR
#include <rtdbg.h>

//#define NU_GMAC_DEBUG
#if defined(NU_GMAC_DEBUG)
    #define NU_GMAC_TRACE         rt_kprintf
#else
    #define NU_GMAC_TRACE(...)
#endif

enum
{
    GMAC_START = -1,
    GMAC0_IDX,
    GMAC_CNT
};

struct nu_gmac
{
    struct eth_device   eth;
    char               *name;
    uint32_t            base;
    IRQn_Type           irqn;
    rt_timer_t          link_timer;
    rt_uint8_t          mac_addr[8];
    synopGMACNetworkAdapter *adapter;
};
typedef struct nu_gmac *nu_gmac_t;

static struct nu_gmac nu_gmac_arr[] =
{
    {
        .name            =  "e0",
        .base            =  EMAC0_BASE,
        .irqn            =  EMAC0_IRQn,
    },
};

void nu_gmac_pkt_dump(const char *msg, const struct pbuf *p)
{
    rt_uint32_t i;
    rt_uint8_t *ptr = p->payload;

    NU_GMAC_TRACE("%s %d byte\n", msg, p->tot_len);

    for (i = 0; i < p->tot_len; i++)
    {
        if ((i % 8) == 0)
        {
            NU_GMAC_TRACE("  ");
        }
        if ((i % 16) == 0)
        {
            NU_GMAC_TRACE("\r\n");
        }
        NU_GMAC_TRACE("%02x ", *ptr);
        ptr++;
    }
    NU_GMAC_TRACE("\n\n");
}

static int nu_gmac_mdio_read(void *adapter, int addr, int reg)
{
    synopGMACdevice *gmacdev = ((synopGMACNetworkAdapter *)adapter)->m_gmacdev;
    u16 data;
    synopGMAC_read_phy_reg(gmacdev->MacBase, addr, reg, &data);
    return data;
}

static void nu_gmac_mdio_write(void *adapter, int addr, int reg, int data)
{
    synopGMACdevice *gmacdev = ((synopGMACNetworkAdapter *)adapter)->m_gmacdev;
    synopGMAC_write_phy_reg(gmacdev->MacBase, addr, reg, data);
}

static s32 synopGMAC_check_phy_init(synopGMACNetworkAdapter *adapter)
{
    struct ethtool_cmd cmd;
    synopGMACdevice *gmacdev = adapter->m_gmacdev;

    if (!mii_link_ok(&adapter->m_mii))
    {
        gmacdev->DuplexMode = FULLDUPLEX;
        gmacdev->Speed      = SPEED100;
        return 0;
    }
    else
    {
        mii_ethtool_gset(&adapter->m_mii, &cmd);
        gmacdev->DuplexMode = (cmd.duplex == DUPLEX_FULL)  ? FULLDUPLEX : HALFDUPLEX ;
        if (cmd.speed == SPEED_1000)
            gmacdev->Speed = SPEED1000;
        else if (cmd.speed == SPEED_100)
            gmacdev->Speed = SPEED100;
        else
            gmacdev->Speed = SPEED10;
    }

    return gmacdev->Speed | (gmacdev->DuplexMode << 4);
}

static void eth_rx_push(nu_gmac_t psNuGMAC)
{
    synopGMACNetworkAdapter *adapter = psNuGMAC->adapter;
    synopGMACdevice *gmacdev = (synopGMACdevice *) adapter->m_gmacdev;
    struct netif *netif = psNuGMAC->eth.netif;

    while (1)
    {
        PKT_FRAME_T *psPktFrame = NULL;
        struct pbuf *pbuf = RT_NULL;
        err_t ret;

        s32 s32PktLen = synop_handle_received_data(gmacdev, &psPktFrame);
        if (s32PktLen <= 0)
        {
            break;
        }

        /* Allocate a pbuf chain of pbufs from the pool. */
        if ((pbuf = pbuf_alloc(PBUF_RAW, s32PktLen, PBUF_POOL)) != NULL)
        {
#if defined(RT_USING_CACHE)
            rt_hw_cpu_dcache_ops(RT_HW_CACHE_INVALIDATE, (void *)psPktFrame, s32PktLen);
#endif
            pbuf_take(pbuf, psPktFrame, s32PktLen);
        }
        else
        {
            rt_kprintf("[%s] drop the packet %08x\n", psNuGMAC->name, psPktFrame);
        }

        /* Free or drop descriptor. */
        synopGMAC_set_rx_qptr(gmacdev,
                              (u32)psPktFrame,
                              PKT_FRAME_BUF_SIZE,
                              0);

        if ((ret = netif->input(pbuf, netif)) != ERR_OK)
        {
            rt_kprintf("[%s] input error %08x err_t:%08x\n", psNuGMAC->name, pbuf, ret);
            pbuf_free(pbuf);
            break;
        }

    } //while(1)

}

static void nu_gmac_isr(int irqno, void *param)
{
    nu_gmac_t psNuGMAC = (nu_gmac_t)param;

    synopGMACNetworkAdapter *adapter = psNuGMAC->adapter;
    synopGMACdevice *gmacdev = (synopGMACdevice *)adapter->m_gmacdev;

    u32 interrupt, dma_status_reg;
    s32 status;
    u32 u32GmacIntSts;

    // Check GMAC interrupt
    u32GmacIntSts = synopGMACReadReg(gmacdev->MacBase, GmacInterruptStatus);
    if (u32GmacIntSts & GmacTSIntSts)
    {
        gmacdev->synopGMACNetStats.ts_int = 1;
        status = synopGMACReadReg(gmacdev->MacBase, GmacTSStatus);
        if (!(status & (1 << 1)))
        {
            NU_GMAC_TRACE("TS alarm flag not set?\n");
        }
        else
        {
            NU_GMAC_TRACE("TS alarm!\n");
        }
    }
    synopGMACWriteReg(gmacdev->MacBase, GmacInterruptStatus, u32GmacIntSts);


    dma_status_reg = synopGMACReadReg(gmacdev->DmaBase, DmaStatus);
    if (dma_status_reg == 0)
    {
        NU_GMAC_TRACE("dma_status ==0\n");
        return;
    }

    if (dma_status_reg & GmacPmtIntr)
    {
        NU_GMAC_TRACE("%s:: Interrupt due to PMT module", psNuGMAC->name);
        synopGMAC_powerup_mac(gmacdev);
    }

    if (dma_status_reg & GmacLineIntfIntr)
    {
        NU_GMAC_TRACE("%s: GMAC status reg is %08x mask is %08x\n",
                      psNuGMAC->name,
                      synopGMACReadReg(gmacdev->MacBase, GmacInterruptStatus),
                      synopGMACReadReg(gmacdev->MacBase, GmacInterruptMask));

        if (synopGMACReadReg(gmacdev->MacBase, GmacInterruptStatus) & GmacRgmiiIntSts)
        {
            NU_GMAC_TRACE("%s: GMAC RGMII status is %08x\n",
                          psNuGMAC->name,
                          synopGMACReadReg(gmacdev->MacBase, GmacRgmiiCtrlSts));
            synopGMACReadReg(gmacdev->MacBase, GmacRgmiiCtrlSts);
        }
    }

    /* DMA status */
    interrupt = synopGMAC_get_interrupt_type(gmacdev);
    if (interrupt & synopGMACDmaError)
    {
        NU_GMAC_TRACE("%s: 0x%08x@%08x\n", psNuGMAC->name, interrupt, dma_status_reg);
        NU_GMAC_TRACE("%s::Fatal Bus Error Interrupt Seen\n", psNuGMAC->name);
        synopGMAC_disable_dma_tx(gmacdev);
        synopGMAC_disable_dma_rx(gmacdev);

