wosayttn/sdk-bsp-numaker-m55m1/libraries/m5531/rtt_port/emac/drv_gmac.c
        synopGMAC_take_desc_ownership_tx(gmacdev);
        synopGMAC_take_desc_ownership_rx(gmacdev);

        synopGMAC_init_tx_rx_desc_queue(gmacdev);

        synopGMAC_reset(gmacdev);

        synopGMAC_set_mac_addr(gmacdev, GmacAddr0High, GmacAddr0Low, &psNuGMAC->mac_addr[0]);
        synopGMAC_dma_bus_mode_init(gmacdev, DmaBurstLength32 | DmaDescriptorSkip0/*DmaDescriptorSkip2*/ | DmaDescriptor8Words);
        synopGMAC_dma_control_init(gmacdev, DmaStoreAndForward | DmaTxSecondFrame | DmaRxThreshCtrl128);
        synopGMAC_init_rx_desc_base(gmacdev);
        synopGMAC_init_tx_desc_base(gmacdev);
        synopGMAC_mac_init(gmacdev);
        synopGMAC_enable_dma_rx(gmacdev);
        synopGMAC_enable_dma_tx(gmacdev);
    }

    if ((interrupt & synopGMACDmaRxNormal) ||
            (interrupt & synopGMACDmaRxAbnormal))
    {
        eth_rx_push(psNuGMAC);

        if (interrupt & synopGMACDmaRxAbnormal)
        {
            NU_GMAC_TRACE("%s: 0x%08x@%08x\n", psNuGMAC->name, interrupt, dma_status_reg);
            NU_GMAC_TRACE("%s::Abnormal Rx Interrupt Seen %08x\n", psNuGMAC->name, dma_status_reg);
            if (gmacdev->GMAC_Power_down == 0)
            {
                gmacdev->synopGMACNetStats.rx_over_errors++;
                synopGMACWriteReg(gmacdev->DmaBase, DmaStatus, DmaIntRxNoBuffer);
                synopGMAC_resume_dma_rx(gmacdev);
            }
        }
    }

    if (interrupt & synopGMACDmaRxStopped)
    {
        NU_GMAC_TRACE("%s: 0x%08x@%08x\n", psNuGMAC->name, interrupt, dma_status_reg);
        NU_GMAC_TRACE("%s::Receiver stopped seeing Rx interrupts\n", psNuGMAC->name); //Receiver gone in to stopped state
        if (gmacdev->GMAC_Power_down == 0)   // If Mac is not in powerdown
        {
            gmacdev->synopGMACNetStats.rx_over_errors++;
            synopGMAC_enable_dma_rx(gmacdev);
        }
    }

    //if (interrupt & synopGMACDmaTxNormal)
    //{
    //NU_GMAC_TRACE("%s::Finished Normal Transmission\n", psNuGMAC->name);
    //synop_handle_transmit_over(gmacdev);//Do whatever you want after the transmission is over
    //}

    if (interrupt & synopGMACDmaTxAbnormal)
    {
        NU_GMAC_TRACE("%s: 0x%08x@%08x\n", psNuGMAC->name, interrupt, dma_status_reg);
        NU_GMAC_TRACE("%s::Abnormal Tx Interrupt Seen\n", psNuGMAC->name);
        //if (gmacdev->GMAC_Power_down == 0)   // If Mac is not in powerdown
        //{
        //synop_handle_transmit_over(gmacdev);
        //}
    }

    if (interrupt & synopGMACDmaTxStopped)
    {
        NU_GMAC_TRACE("%s: 0x%08x@%08x\n", psNuGMAC->name, interrupt, dma_status_reg);
        NU_GMAC_TRACE("%s::Transmitter stopped sending the packets\n", psNuGMAC->name);
        if (gmacdev->GMAC_Power_down == 0)    // If Mac is not in powerdown
        {
            synopGMAC_disable_dma_tx(gmacdev);
            synopGMAC_take_desc_ownership_tx(gmacdev);
            synopGMAC_enable_dma_tx(gmacdev);
            NU_GMAC_TRACE("%s::Transmission Resumed\n", psNuGMAC->name);
        }
    }
}

void EMAC0_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    nu_gmac_isr(EMAC0_IRQn, &nu_gmac_arr[GMAC0_IDX]);

    /* leave interrupt */
    rt_interrupt_leave();
}

static void nu_phy_monitor(void *pvData)
{
    nu_gmac_t psNuGMAC = (nu_gmac_t)pvData;
    synopGMACNetworkAdapter *adapter = psNuGMAC->adapter;
    synopGMACdevice         *gmacdev = adapter->m_gmacdev;

    LOG_D("Create %s link monitor timer.", psNuGMAC->name);
    while (1)
    {
        if (!mii_link_ok(&adapter->m_mii))
        {
            if (gmacdev->LinkState)
            {
                eth_device_linkchange(&psNuGMAC->eth, RT_FALSE);
                LOG_I("%s: No Link", psNuGMAC->name);
            }
            gmacdev->DuplexMode = 0;
            gmacdev->Speed = 0;
            gmacdev->LoopBackMode = 0;
            gmacdev->LinkState = 0;
        }
        else
        {
            s32 data = synopGMAC_check_phy_init(adapter);
            if (gmacdev->LinkState != data)
            {
                synopGMAC_mac_init(gmacdev);
                LOG_I("Link is up in %s mode", (gmacdev->DuplexMode == FULLDUPLEX) ? "FULL DUPLEX" : "HALF DUPLEX");
                if (gmacdev->Speed == SPEED1000)
                {
                    LOG_I("Link is with 1000M Speed");
                    synopGMAC_set_mode(gmacdev, 0);
                }
                if (gmacdev->Speed == SPEED100)
                {
                    LOG_I("Link is with 100M Speed");
                    synopGMAC_set_mode(gmacdev, 1);
                }
                if (gmacdev->Speed == SPEED10)
                {
                    LOG_I("Link is with 10M Speed");
                    synopGMAC_set_mode(gmacdev, 2);
                }

                gmacdev->LinkState = data;
                eth_device_linkchange(&psNuGMAC->eth, RT_TRUE);
            }
        }

        //NU_GMAC_TRACE("%s: Interrupt enable: %08x, status:%08x\n", psNuGMAC->name, synopGMAC_get_ie(gmacdev), synopGMACReadReg(gmacdev->DmaBase, DmaStatus));
        //NU_GMAC_TRACE("%s: op:%08x\n", psNuGMAC->name, synopGMACReadReg(gmacdev->DmaBase, DmaControl));
        //NU_GMAC_TRACE("%s: debug:%08x\n", psNuGMAC->name, synopGMACReadReg(gmacdev->MacBase, GmacDebug));

        rt_thread_mdelay(1000);

    } //  while (1)

}

#if defined(RT_USING_CACHE)
    static NVT_NONCACHEABLE DmaDesc s_TXDescBufPool[TRANSMIT_DESC_SIZE];
    static NVT_NONCACHEABLE DmaDesc s_RXDescBufPool[RECEIVE_DESC_SIZE];
#endif

static void nu_memmgr_init(GMAC_MEMMGR_T *psMemMgr)
{
    psMemMgr->u32TxDescSize = TRANSMIT_DESC_SIZE;
    psMemMgr->u32RxDescSize = RECEIVE_DESC_SIZE;

#if defined(RT_USING_CACHE)

    psMemMgr->psTXDescs   = (DmaDesc *)&s_TXDescBufPool[0];
    psMemMgr->psRXDescs   = (DmaDesc *)&s_RXDescBufPool[0];

    psMemMgr->psTXFrames = (PKT_FRAME_T *) rt_malloc_align(sizeof(PKT_FRAME_T) * psMemMgr->u32TxDescSize, RT_ALIGN_SIZE);
    RT_ASSERT(psMemMgr->psTXFrames);
    LOG_D("[%s] First TXFrameAddr= %08x", __func__, psMemMgr->psTXFrames);

    psMemMgr->psRXFrames = (PKT_FRAME_T *) rt_malloc_align(sizeof(PKT_FRAME_T) * psMemMgr->u32RxDescSize, RT_ALIGN_SIZE);
    RT_ASSERT(psMemMgr->psRXFrames);
    LOG_D("[%s] First RXFrameAddr= %08x", __func__, psMemMgr->psRXFrames);

#else

    psMemMgr->psTXDescs = (DmaDesc *) rt_malloc_align(sizeof(DmaDesc) * psMemMgr->u32TxDescSize, RT_ALIGN_SIZE);
    RT_ASSERT(psMemMgr->psTXDescs);
    LOG_D("[%s] First TXDescAddr= %08x", __func__, psMemMgr->psTXDescs);

    psMemMgr->psRXDescs = (DmaDesc *) rt_malloc_align(sizeof(DmaDesc) * psMemMgr->u32RxDescSize, RT_ALIGN_SIZE);
    RT_ASSERT(psMemMgr->psRXDescs);
    LOG_D("[%s] First RXDescAddr= %08x", __func__, psMemMgr->psRXDescs);

    psMemMgr->psTXFrames = (PKT_FRAME_T *) rt_malloc_align(sizeof(PKT_FRAME_T) * psMemMgr->u32TxDescSize, RT_ALIGN_SIZE);
    RT_ASSERT(psMemMgr->psTXFrames);
    LOG_D("[%s] First TXFrameAddr= %08x", __func__, psMemMgr->psTXFrames);

    psMemMgr->psRXFrames = (PKT_FRAME_T *) rt_malloc_align(sizeof(PKT_FRAME_T) * psMemMgr->u32RxDescSize, RT_ALIGN_SIZE);
    RT_ASSERT(psMemMgr->psRXFrames);
    LOG_D("[%s] First RXFrameAddr= %08x", __func__, psMemMgr->psRXFrames);
#endif

