wosayttn/sdk-bsp-numaker-m55m1/libraries/m5531/rtt_port/emac/drv_gmac.c
}

static void nu_mii_init(synopGMACNetworkAdapter *adapter)
{
    /* MII setup */
    adapter->m_mii.phy_id_mask   = 0x1F;
    adapter->m_mii.reg_num_mask  = 0x1F;
    adapter->m_mii.adapter       = (void *)adapter;
    adapter->m_mii.mdio_read     = nu_gmac_mdio_read;
    adapter->m_mii.mdio_write    = nu_gmac_mdio_write;
    adapter->m_mii.phy_id        = adapter->m_gmacdev->PhyBase;
    adapter->m_mii.supports_gmii = mii_check_gmii_support(&adapter->m_mii);
}

static void nu_phy_link_monitor(nu_gmac_t psNuGMAC)
{
    rt_thread_t threadCtx = rt_thread_create(psNuGMAC->name,
                            nu_phy_monitor,
                            psNuGMAC,
                            1024,
                            25,
                            5);

    if (threadCtx != RT_NULL)
        rt_thread_startup(threadCtx);
}

static rt_err_t nu_gmac_init(rt_device_t device)
{
    rt_err_t ret;
    s32 status = 0;
    char szTmp[32];
    int count;

    nu_gmac_t psNuGMAC = (nu_gmac_t)device;
    RT_ASSERT(psNuGMAC);

    synopGMACNetworkAdapter *adapter = psNuGMAC->adapter;
    synopGMACdevice *gmacdev = (synopGMACdevice *)adapter->m_gmacdev;
    GMAC_MEMMGR_T *psgmacmemmgr = (GMAC_MEMMGR_T *)adapter->m_gmacmemmgr;

    RT_ASSERT(gmacdev);
    RT_ASSERT(psgmacmemmgr);

    LOG_D("[%s] Init %s", __func__, psNuGMAC->name);

    synopGMAC_attach(gmacdev, ((uint32_t)psNuGMAC->base + MACBASE), ((uint32_t)psNuGMAC->base + DMABASE), DEFAULT_PHY_BASE, &psNuGMAC->mac_addr[0]);
    nu_mii_init(adapter);

    /* Reset to make RGMII/RMII setting take affect. */
    synopGMAC_reset(gmacdev);
    synopGMAC_read_version(gmacdev);
    LOG_I("%s: HW version is %08x", psNuGMAC->name, gmacdev->Version);

    /*Check for Phy initialization*/
    synopGMAC_set_mdc_clk_div(gmacdev, GmiiCsrClk2);
    gmacdev->ClockDivMdc = synopGMAC_get_mdc_clk_div(gmacdev);
    status = synopGMAC_check_phy_init(adapter);

    /*Set up the tx and rx descriptor queue/ring*/
    LOG_D("tx desc_queue");
    synopGMAC_setup_tx_desc_queue(gmacdev, &psgmacmemmgr->psTXDescs[0], TRANSMIT_DESC_SIZE, RINGMODE);
    synopGMAC_init_tx_desc_base(gmacdev);
    LOG_D("DmaTxBaseAddr = %08x", synopGMACReadReg(gmacdev->DmaBase, DmaTxBaseAddr));

    LOG_D("rx desc_queue");
    synopGMAC_setup_rx_desc_queue(gmacdev, &psgmacmemmgr->psRXDescs[0], RECEIVE_DESC_SIZE, RINGMODE);
    synopGMAC_init_rx_desc_base(gmacdev);
    LOG_D("DmaRxBaseAddr = %08x", synopGMACReadReg(gmacdev->DmaBase, DmaRxBaseAddr));

    /*Initialize the dma interface*/
    synopGMAC_dma_bus_mode_init(gmacdev, DmaBurstLength32 | DmaDescriptorSkip0/*DmaDescriptorSkip2*/ | DmaDescriptor8Words);
    synopGMAC_dma_control_init(gmacdev, DmaStoreAndForward | DmaTxSecondFrame | DmaRxThreshCtrl128);

    /*Initialize the mac interface*/
    gmacdev->Speed = SPEED100;
    gmacdev->DuplexMode = FULLDUPLEX;
    synopGMAC_mac_init(gmacdev);

    synopGMAC_pause_control(gmacdev); // This enables the pause control in Full duplex mode of operation
    //synopGMAC_jumbo_frame_enable(gmacdev); // enable jumbo frame

#if defined(RT_LWIP_USING_HW_CHECKSUM)
    /*IPC Checksum offloading is enabled for this driver. Should only be used if Full Ip checksumm offload engine is configured in the hardware*/
    synopGMAC_enable_rx_chksum_offload(gmacdev);    //Enable the offload engine in the receive path
    synopGMAC_rx_tcpip_chksum_drop_enable(gmacdev); // This is default configuration, DMA drops the packets if error in encapsulated ethernet payload
#endif

    /* Set all RX frame buffers. */
    count = 0;
    do
    {
        LOG_D("[%s] Set %d pkt frame buffer address - 0x%08x, size=%d", __func__, count, (u32)(&psgmacmemmgr->psRXFrames[count]), PKT_FRAME_BUF_SIZE);
        status = synopGMAC_set_rx_qptr(gmacdev, (u32)(&psgmacmemmgr->psRXFrames[count]), PKT_FRAME_BUF_SIZE, 0);
        if (status < 0)
        {
            LOG_E("status < 0!!");
            break;
        }
        count++;
    }
    while (count < RECEIVE_DESC_SIZE);

    synopGMAC_clear_interrupt(gmacdev);

    synopGMAC_disable_interrupt_all(gmacdev);
    synopGMAC_enable_interrupt(gmacdev, DmaIntEnable);
    LOG_D("%s: Interrupt enable: %08x", psNuGMAC->name, synopGMAC_get_ie(gmacdev));

    synopGMAC_enable_dma_rx(gmacdev);
    synopGMAC_enable_dma_tx(gmacdev);

    synopGMAC_set_mac_addr(gmacdev, GmacAddr0High, GmacAddr0Low, &psNuGMAC->mac_addr[0]);

    synopGMAC_set_mode(gmacdev, 0);
    nu_phy_link_monitor(psNuGMAC);

    /* Enable NVIC interrupt. */
    LOG_D("[%s] Install %s ISR.", __func__, psNuGMAC->name);
    NVIC_EnableIRQ(psNuGMAC->irqn);

    LOG_D("[%s] Init %s done", __func__, psNuGMAC->name);

    return RT_EOK;
}

static rt_err_t nu_gmac_open(rt_device_t dev, rt_uint16_t oflag)
{
    return RT_EOK;
}

static rt_err_t nu_gmac_close(rt_device_t dev)
{
    return RT_EOK;
}

static rt_size_t nu_gmac_read(rt_device_t dev, rt_off_t pos, void *buffer, rt_size_t size)
{
    rt_set_errno(-RT_ENOSYS);
    return 0;
}

static rt_size_t nu_gmac_write(rt_device_t dev, rt_off_t pos, const void *buffer, rt_size_t size)
{
    rt_set_errno(-RT_ENOSYS);
    return 0;
}

static rt_err_t nu_gmac_control(rt_device_t device, int cmd, void *args)
{
    nu_gmac_t psNuGMAC = (nu_gmac_t)device;
    RT_ASSERT(device);

    switch (cmd)
    {
    case NIOCTL_GADDR:
        if (args) rt_memcpy(args, &psNuGMAC->mac_addr[0], 6);
        else return -RT_ERROR;
        break;

    default :
        break;
    }

    return RT_EOK;
}

rt_err_t nu_gmac_tx(rt_device_t device, struct pbuf *p)
{
    rt_err_t ret = -RT_ERROR;

    nu_gmac_t psNuGMAC = (nu_gmac_t)device;
    synopGMACNetworkAdapter *adapter = (synopGMACNetworkAdapter *) psNuGMAC->adapter;
    synopGMACdevice *gmacdev = (synopGMACdevice *) adapter->m_gmacdev;
    GMAC_MEMMGR_T *psgmacmemmgr = (GMAC_MEMMGR_T *)adapter->m_gmacmemmgr;

    u32 index = gmacdev->TxNext;
    u8 *pu8PktData = (u8 *)((u32)&psgmacmemmgr->psTXFrames[index]);
    struct pbuf *q;
    rt_uint32_t offset = 0;
    u32 offload_needed;
    s32 status;

