wosayttn/sdk-bsp-numaker-m55m1/libraries/m5531/rtt_port/emac/drv_gmac.c
    LOG_D("%s: Transmitting data(%08x-%d) start.", psNuGMAC->name, (u32)pu8PktData, p->tot_len);

    /* Copy to TX data buffer. */
    for (q = p; q != NULL; q = q->next)
    {
        rt_uint8_t *ptr = q->payload;
        rt_uint32_t len = q->len;
        memcpy(&pu8PktData[offset], ptr, len);
        offset += len;
    }
#if defined(RT_USING_CACHE)
    rt_hw_cpu_dcache_ops(RT_HW_CACHE_FLUSH, (void *)pu8PktData, offset);
#endif

#if defined(RT_LWIP_USING_HW_CHECKSUM)
    offload_needed = 1;
#else
    offload_needed = 0;
#endif

    status = synopGMAC_xmit_frames(gmacdev, (u8 *)pu8PktData, offset, offload_needed, 0);
    if (status != 0)
    {
        LOG_E("%s No More Free Tx skb", __func__);
        ret = -RT_ERROR;
        goto exit_nu_gmac_tx;
    }

    synop_handle_transmit_over(gmacdev);

    LOG_D("%s: Transmitting data(%08x-%d) done.", psNuGMAC->name, (u32)pu8PktData, p->tot_len);

    ret = RT_EOK;

exit_nu_gmac_tx:

    return ret;
}

static void nu_gmac_assign_macaddr(nu_gmac_t psNuGMAC)
{
    static rt_uint32_t value = 0x94539452;
    uint32_t uid[4] = {0};

    /* Read UID from FMC for unique MAC address. */
    void nu_read_uid(uint32_t *id);
    nu_read_uid((uint32_t *)&uid);

    value = value ^ uid[0] ^ uid[1] ^ uid[2] ^ uid[3];

    LOG_I("UID: %08X-%08X-%08X-%08X, value: %08x", uid[0], uid[1], uid[2], uid[3], value);

    /* Assign MAC address */
    psNuGMAC->mac_addr[0] = 0x82;
    psNuGMAC->mac_addr[1] = 0x06;
    psNuGMAC->mac_addr[2] = 0x21;
    psNuGMAC->mac_addr[3] = (value >> 16) & 0xff;
    psNuGMAC->mac_addr[4] = (value >> 8) & 0xff;
    psNuGMAC->mac_addr[5] = (value) & 0xff;

    LOG_I("MAC address: %02X:%02X:%02X:%02X:%02X:%02X", \
          psNuGMAC->mac_addr[0], \
          psNuGMAC->mac_addr[1], \
          psNuGMAC->mac_addr[2], \
          psNuGMAC->mac_addr[3], \
          psNuGMAC->mac_addr[4], \
          psNuGMAC->mac_addr[5]);
    value++;
}

int32_t nu_gmac_adapter_init(nu_gmac_t psNuGMAC)
{
    synopGMACNetworkAdapter *adapter;

    RT_ASSERT(psNuGMAC);

    /* Allocate net adapter */
    adapter = (synopGMACNetworkAdapter *)rt_malloc_align(sizeof(synopGMACNetworkAdapter), RT_ALIGN_SIZE);
    RT_ASSERT(adapter);
    rt_memset((void *)adapter, 0, sizeof(synopGMACNetworkAdapter));

    /* Allocate device */
    adapter->m_gmacdev = (synopGMACdevice *) rt_malloc_align(sizeof(synopGMACdevice), RT_ALIGN_SIZE);
    RT_ASSERT(adapter->m_gmacdev);
    rt_memset((char *)adapter->m_gmacdev, 0, sizeof(synopGMACdevice));

    /* Allocate memory management */
    adapter->m_gmacmemmgr = (GMAC_MEMMGR_T *) rt_malloc_align(sizeof(GMAC_MEMMGR_T), RT_ALIGN_SIZE);
    RT_ASSERT(adapter->m_gmacmemmgr);
    nu_memmgr_init(adapter->m_gmacmemmgr);

    /* Store adapter to priv */
    psNuGMAC->adapter = adapter;

    return 0;
}

int rt_hw_gmac_init(void)
{
    int i;
    rt_err_t ret = RT_EOK;

    for (i = (GMAC_START + 1); i < GMAC_CNT; i++)
    {
        nu_gmac_t psNuGMAC = (nu_gmac_t)&nu_gmac_arr[i];

        /* Register member functions */
        psNuGMAC->eth.parent.type       = RT_Device_Class_NetIf;
        psNuGMAC->eth.parent.init       = nu_gmac_init;
        psNuGMAC->eth.parent.open       = nu_gmac_open;
        psNuGMAC->eth.parent.close      = nu_gmac_close;
        psNuGMAC->eth.parent.read       = nu_gmac_read;
        psNuGMAC->eth.parent.write      = nu_gmac_write;
        psNuGMAC->eth.parent.control    = nu_gmac_control;
        psNuGMAC->eth.parent.user_data  = psNuGMAC;
        psNuGMAC->eth.eth_rx            = RT_NULL;
        psNuGMAC->eth.eth_tx            = nu_gmac_tx;

        /* Set MAC address */
        nu_gmac_assign_macaddr(psNuGMAC);

        /* Initial GMAC adapter */
        nu_gmac_adapter_init(psNuGMAC);

        /* Register eth device */
        ret = eth_device_init(&psNuGMAC->eth, psNuGMAC->name);
        RT_ASSERT(ret == RT_EOK);
    }

    return 0;
}
INIT_DEVICE_EXPORT(rt_hw_gmac_init);

#if 1
/*
    Remeber src += lwipiperf_SRCS in components\net\lwip\lwip-*\SConscript
*/
#include "lwip/apps/lwiperf.h"

static void
lwiperf_report(void *arg, enum lwiperf_report_type report_type,
               const ip_addr_t *local_addr, u16_t local_port, const ip_addr_t *remote_addr, u16_t remote_port,
               u32_t bytes_transferred, u32_t ms_duration, u32_t bandwidth_kbitpsec)
{
    LWIP_UNUSED_ARG(arg);
    LWIP_UNUSED_ARG(local_addr);
    LWIP_UNUSED_ARG(local_port);

    rt_kprintf("IPERF report: type=%d, remote: %s:%d, total bytes: %"U32_F", duration in ms: %"U32_F", kbits/s: %"U32_F"\n",
               (int)report_type, ipaddr_ntoa(remote_addr), (int)remote_port, bytes_transferred, ms_duration, bandwidth_kbitpsec);
}

int lwiperf_example_init(void)
{
    lwiperf_start_tcp_server_default(lwiperf_report, NULL);

    return 0;
}
MSH_CMD_EXPORT(lwiperf_example_init, start lwip tcp server);
INIT_APP_EXPORT(lwiperf_example_init);
#endif

#endif /* if defined(BSP_USING_GMAC) */
